[
January 1, 2020
Samuelino Pitchout Mavinga, a 40-year-old native of Angola and citizen of France in ICE custody, passed away Sunday, December 29, 2019, at the Presbyterian Hospital in Albuquerque, New Mexico. The preliminary cause of death was identified as cardiac arrest. Per ICE, Mr. Mavinga was taken into CBP custody on November 11, 2019, “for remaining in the United States for a period longer than authorized,” and transferred into ICE custody on November 12. He was detained at the Otero County Processing Center in Chaparral, New Mexico. On December 11, he was transferred to the Torrance County Detention Facility in Estancia, New Mexico, and was transported to the Presbyterian Hospital the next day for medical treatment. According to Buzzfeed News, this is the fourth death in ICE custody in FY2020.

ICE Press Release: ICE Detainee Passes Away in Albuquerque Hospital

Buzzfeed News: A French Man Has Died While at a Hospital in ICE Custody – December 30, 2019

December 23, 2019
Anthony Oluseye Akinyemi, 56, a Nigerian citizen, passed away on December 21, 2019, at the Worcester County Jail in Snow Hill, Maryland, after he was found unresponsive in his cell and efforts to revive him were unsuccessful. Per ICE, the preliminary cause of death appears to be self-inflicted strangulation. Mr. Akinyemi had been ICE custody for less than 24 hours.

ICE Press Release: Nigerian Man in ICE Custody Passes Away in Maryland

NY Daily News: Nigerian Man Dead by Apparent Suicide in ICE Custody – December 23, 2019

October 16, 2019
Roylan Hernandez-Diaz, a 43-year-old man from Cuba who'd been ICE custody at the Richwood Correctional Center in Richwood, Louisiana, passed away on October 15, 2019, at the facility. Mr. Hernandez-Diaz was found unresponsive in his cell and efforts by facility staff and emergency personnel to revive him were unsuccessful. Per ICE, the preliminary cause of death appears to be "self-inflicted strangulation." Mr. Hernandez-Diaz entered ICE custody on May 20, 2019, two days after he was encountered by CBP at the Paso Del Norte Port of Entry in El Paso, Texas. At the time of his death, Mr. Hernandez-Diaz's case was pending before the federal immigration courts.

ICE Press Release: ICE detainee passes away in Louisiana

CBS News: Cuban immigrant dies in ICE custody – October 16, 2019


October 2, 2019
Nebane Abienwi, a 37-year-old man from Cameroon who’d been ICE custody at the Otay Mesa Detention Center in San Diego, California, passed away on October 1, 2019, at the Sharp Chula Vista Medical Center. The medical staff identified the cause of death as brain death secondary to basal ganglia hemorrhage. According to DHS records, Mr. Abienwi applied for admission into the United States without proper entry documents on September 5 at the San Ysidro Port of Entry and was transferred to ICE custody on September 9. He was taken to the Chula Vista Medical Center on September 24 after experiencing a hypertensive event. Buzzfeed News reports that this is the first death in ICE custody in FY2020. Eight individuals passed away in ICE custody in FY2019.

ICE Press Release: ICE detainee passes away at Chula Vista Hospital

Buzzfeed News: A Man From Cameroon Has Died in ICE Custody in San Diego – October 2, 2019

September 12, 2019
Roberto Rodriguez-Espinoza, a 37-year-old Mexican national who'd been in ICE custody at the McHenry County Adult Correctional Facility (MCACF) in Woodstock, Illinois, died September 10 at the Northwestern Medicine Central DuPage Hospital in Winfield, Illinois. Rodriguez-Espinoza was placed into ICE custody on September 3, 2019, and was taken to the Northwestern Medicine Woodstock Hospital emergency room on September 7 due to confusion. He was diagnosed with a brain hemorrhage on September 8 at the Northwestern Medicine Huntley Hospital in Huntley, Illinois, and was then transferred to Central DuPage Hospital, where he failed to respond during a neurological exam. The attending physicians identified subdural hematoma as the preliminary cause of death. Per ICE, Rodriguez-Espinoza is the eighth individual to pass away in ICE custody in fiscal year 2019.

ICE Press Release: ICE detainee from Mexico passes away at Illinois hospital

Buzzfeed News: A Mexican Man Has Died In ICE Custody. He's The 8th Death In US Custody This Year.

July 25, 2019
Pedro Arriago-Santoya, a 44-year-old Mexican national who’d been in ICE custody awaiting removal at the Stewart Detention Facility in Lumpkin, Georgia, passed away at the Piedmont Midtown Medical Center in Columbus, Georgia, on July 24. The preliminary cause of death has been identified as cardio-pulmonary arrest, secondary to multi-organ system failure, endocarditis, dilated cardiomyopathy with a low ejection fraction and respiratory failure. Mr. Arriago-Santoya was taken to the hospital on July 20 after complaining of abdominal pain. Per ICE, he is the seventh individual to pass away in ICE custody in FY2019.

ICE Press Release: ICE Detainee Passes Away at Georgia Hospital
BuzzFeed News: A Mexican Man Has Died in ICE Custody in Georgia

July 1, 2019
Yimi Alexis Balderramos-Torres, 30, entered ICE custody on June 6. On June 18, Balderramos-Torres was transferred to the Houston Contract Detention Facility (HCDF) in Houston, Texas. On June 30, Balderramos-Torres was found unresponsive in his dormitory. Attempts by medical personnel from ICE Health Service Corps (IHSC) and Emergency Medical Services (EMS)to revive Balderramos-Torres were unsuccessful. EMS immediately transferred him to MHNH; MHNH medical staff pronounced him deceased on June 30 at 6:45 am (CT).

ICE press release: ICE detainee passes away in Houston-area hospital

June 3, 2019
NBC News reports that Johana Medina Leon, 25, complained of chest pains and was brought to Del Sol Medical Center in El Paso, Texas. The transgender woman from El Salvador seeking asylum in the United States died June 1, 2019, in a Texas hospital four days after being released from custody.

May 6, 2019
Simratpal Singh, 21, an Indian national in ICE custody at the La Paz County Jail (LPCJ) passed away after efforts by medical staff to revive him were unsuccessful. An autopsy is pending to determine the official cause of death.

ICE press release: ICE detainee passes away at the La Paz County Jail

April 4, 2019
Abel Reyes-Clemente, 54, a Mexican national in the custody of U.S. Immigration and Customs Enforcement (ICE) at the Florence Service Processing Center (SPC) passed away Wednesday morning after efforts by medical staff and local paramedics to revive him were unsuccessful. An autopsy is pending to determine the official cause of death.

ICE press release: ICE detainee passes away at the Florence Service Processing Center

December 3, 2018
A Russian national in the custody of U.S. Immigration and Customs Enforcement (ICE) at the Baker County Detention Center died Friday afternoon at a Jacksonville hospital after he went into cardiac arrest and efforts by hospital medical staff to revive him were unsuccessful.

Guerman Volkov, 56, was pronounced dead at University of Florida Health Jacksonville Medical Center. Mr. Volkov died two days after he was discharged from another Jacksonville hospital after he made the decision to discontinue all medical treatment. The official cause of Mr. Volkov’s death is under investigation but is believed to be cardiac-related natural causes.

ICE press release: Russian national in ICE custody passes away at Florida hospital

November 26, 2018
Mergensana Amar, 40, a Russian national in the custody of U.S. Immigration and Customs Enforcement (ICE) was removed from life support Saturday afternoon, after attempting to take his own life on Nov. 15.

After finding Amar unresponsive in his cell at the Northwest Detention Center on Nov. 15, medical staff at the detention center immediately called 911 and began efforts to resuscitate him. Amar was rushed to Saint Joseph's Medical Center in Tacoma, admitted to the hospital's intensive care unit, and placed on life support. While Amar remained on life support through Nov. 24, medical records will mark his official date of passing as Nov. 18, as brain activity ceased on that day. The preliminary cause of death has been identified as anoxic brain injury due to asphyxiation.

Despite his previous participation in a hunger strike, Amar remained in good physical health prior to this incident and was monitored daily by ICE Health Service Corps medical professionals. While he refused meals provided by the detention center for a number of days, he began consuming fresh fruit, electrolytes and meal replacement shakes on Sep. 19, consuming sufficient calories to be removed from hunger strike status on October 16. ICE has not previously released the timeline of his hunger strike status due to Amar's repeated threats to resume the hunger strike should its end be made public.

ICE press release: ICE detainee passes away at local hospital

November 2, 2018
Wilfredo Padron, 58, was pronounced dead at Lower Keys Medical Center (LKMC) in Key West, at 7:17 a.m. The official cause of death remains under investigation but it is believed to be "cardiac-related natural causes." The Cuban national in the custody of U.S. Immigration and Customs Enforcement at the Monroe County Detention Center (MCDC) in Key West, Florida, died Thursday at an area hospital after he was found unresponsive in his cell and efforts by facility staff and emergency personnel to revive him were unsuccessful.

ICE press release: ICE Detainee Passes Away at Monroe County Hospital

July 26, 2018
Augustina Ramirez-Arreola, a 62-year-old Mexican national was pronounced dead on July 26, 2018, by medical staff at the Alvarado Hospital in La Mesa, California, while in the custody of ICE. An autopsy is pending to determine the official cause of death. The preliminary cause was identified by hospital staff as complications from surgery. Ms. Ramirez-Arreola had been transferred to the hospital from ICE's Otay Mesa Detention Center earlier in the day for a scheduled surgery to treat a heart abnormality.

ICE press release: ICE Detainee Passes Away

July 12, 2018
Efrain De La Rosa, 40, a Mexican national, was pronounced dead at Southwest Georgia Regional Medical Center in Cuthbert, Georgia, at 11:29 p.m. Stewart facility staff conducting scheduled monitoring discovered Mr. De La Rosa unresponsive in his cell at approximately 10:38 p.m. Facility staff and medical personnel immediately began to perform CPR and contacted Stewart County Emergency Medical Services, which arrived at the facility at 10:48 p.m. The preliminary cause of death appears to be self-inflicted strangulation; however, the case is currently under investigation.

ICE press release: ICE Detainee Passes Away at Georgia Hospital

June 16, 2018
Huy Chi Tran, 47, a Vietnamese national, was transferred to ICE custody on May 25, 2018, and transferred to the Eloy Detention Center on May 28, 2018, pending removal to Vietnam. Mr. Tran was found unresponsive on June 5, 2018, and local paramedics transported him to the Banner Casa Grande Medical Center. He was declared deceased on June 12, 2018; an autopsy is pending to determine the official cause of death.

ICE press release: ICE Detainee Passes Away at the Eloy Detention Facility

June 8, 2018
Zeresenay Ermias Testfatsion, 34, a Eritrean national in transit to his home country, was being held by Egyptian authorities as he awaited removal to Asmara, Eritrea. Egyptian authorities later notified ICE that they found him deceased in a shower area. Egyptian officials later transported the remains to Heliopolis Hospital.

ICE press release: ICE Detainee Passes Away in Transit to Home Country

Matthew Hoppock submitted a FOIA for Zeresenay Ermias Testfatsion's A file, and USCIS posted a redacted version in response.

May 25, 2018
Roxana Hernandez, 33, a Honduran woman, entered ICE custody on May 13 in San Diego. Two days later, ERO San Diego transferred her to ERO El Paso, and on May 16 Hernandez arrived at the Cibola County Correctional Center in Milan, New Mexico, where she was housed in the transgender unit. Medical staff pronounced her deceased May 25 at 3:32 a.m. (MDT), and identified the preliminary cause of death as cardiac arrest. On May 9, 2018, Hernandez was processed as an expedited removal when she applied for admission at the San Ysidro Port of Entry in California. Advocacy groups identified the deceased’s first name as Roxana.

ICE press release: ICE Detainee from Honduras Passes Away in New Mexico Hospital

May 21, 2018
Ronald Cruz, a 39-year-old Honduran national, died May 16, 2018, at the Valley Baptist Medical Center. Mr. Cruz was arrested on May 9, 2018, for unauthorized entry into the United States and transferred to ICE’s Port Isabel Detention Center (PIDC) on May 14, 2018. He was transferred to Valley Baptist Medical Center’s intensive care unit on May 16, 2018, where medical staff pronounced him deceased later that day. The preliminary cause of death was identified as cardiac arrest.

ICE press release: South Texas ICE Detainee from Honduras Passes Away in Local Hospital

April 12, 2018
Gourgen Mirimanian, 54, an Armenian national, died April 10, 2018, at the Texas Health Huguley Hospital. He entered ICE custody at the Prairieland Detention Center (PDC) in Alvarado, Texas, on February 6, 2018. On December 12, 2017, ICE deportation officers encountered Mr. Mirimanian at a Bureau of Prisons facility in Fort Worth, and lodged an immigration detainer on him. On February 6, 2018, the Bureau of Prisons released Mirimanian to ICE custody.

ICE press release: Dallas-area ICE detainee passes away at local hospital

February 21, 2018
Luis Ramirez-Marcano, 59, a Cuban national, was transported February 17, to KRMC when ICE Health Service Corps (IHSC) medical personnel at the Krome Detention Center determined he should be taken to an emergency room for treatment after complaints of abdominal pain. He passed away the afternoon of February 19. Mr. Ramirez-Marcano had been in ICE custody since January 12 pending his removal to Cuba.

ICE press release: ICE detainee passes away at Kendall Regional Medical Center in Miami

January 31, 2018
Yulio Castro-Garrido, 33, a Cuban national in the custody of U.S. Immigration and Customs Enforcement (ICE) died Tuesday night at the Mayo Clinic in Jacksonville, Fla. Yulio Castro-Garrido, 33, was transported Jan. 7 to Southwest Regional Medical Center (SWRMC) in Cuthbert, Ga. after ICE Health Service Corps (ISHC) medical personnel at the Stewart Detention Center (SDC) in Lumpkin, Ga. diagnosed him with pneumonia. Mr. Castro entered ICE custody on Nov. 24, following his transfer from the D. Ray James Federal Correctional Institute in Folkston, Ga. Castro was convicted Dec 8, 2016 of conspiracy to transport and move an undocumented alien within the United States by means of transportation and sentenced to a year and one day of confinement and three years of supervised probation. An immigration judge with the Executive Office for Immigration Review ordered Castro to be removed to Cuba Jan. 4; Mr. Castro waived his right to appeal.

ICE press release: ICE detainee passes away

December 4, 2017
Kamyar Samimi, 64, entered ICE custody at the Aurora Contract Detention Facility (ACDF) on November 17, 2017. ACDF personnel contacted emergency medical services (EMS) when Samimi fell ill on December 2, 2017. After EMS arrived, he became unresponsive and EMS began CPR and transported Samimi to University of Colorado Medical Center (UCMC) in Aurora, Colorado, where he was pronounced dead by UCMC medical staff at 12:02 pm, with the preliminary cause of death being cardiac arrest.

ICE press release: Denver-area ICE Detainee Passes Away at Local Hospital

September 18, 2017
Felipe Almazan-Ruiz, 51, entered ICE custody in Miami, Florida, on July 12, 2017. On September 8, Almazan-Ruiz was transferred from the Glades County (Florida) Detention Center to the IAH Secure Adult Detention Center in Livingston, Texas, due to an evacuation from Hurricane Irma.

On September 12, Almazan-Ruiz was initially treated by medical staff at the IAH Secure Adult Detention Center and transported to the Livingston Memorial hospital emergency room for treatment of cirrhosis of the liver. He was later transferred and admitted to the Conroe Regional Medical Center because of the high volume activity and limited bed-space at the Livingston Memorial hospital. He died about 5:15 a.m. (CDT) on September 17.

ICE press release: Houston-area detainee passes away at local hospital

September 5, 2017
Osvadis Montesino-Cabrera, 37, a Cuban national, died at Larkin Community Hospital one week after he was found unresponsive in his hospital shower after a self-inflicted strangulation attempt. Mr. Montesino-Cabrera is the 11th detainee to pass away in ICE custody in FY2017.

ICE press release: ICE detainee passes away at Larkin Community Hospital

June 12, 2017
Carlos Mejia-Bonilla, 44, a Salvadorian national in the custody of ICE passed away from internal bleeding and hemorrhagic shock. On June 8, 2017, he was admitted to the Jersey City Medical Center's Intensive Care Unit due to gastrointestinal bleeding. On June 10, 2017, Mr. Mejia died due to complications resulting from his condition.

ICE press release: New York-area ICE detainee passes away

June 2, 2017
Vicente Caceres-Maradiaga, 46, a Honduran national in the custody of U.S. Immigration and Customs Enforcement, collapsed while playing soccer at the Adelanto Detention Facility in California. He passed away a short time later while in an ambulance as he was being transported to Victorville hospital.

ICE press release: ICE detainee passes away en route to Victorville hospital

May 17, 2017
Atulkumar Babubhai Patel, 58, an Indian national who was briefly in the custody of U.S. Immigration and Customs Enforcement at the Atlanta City Detention Center for two days died Tuesday afternoon at an Atlanta hospital. The preliminary cause of death has been ruled to be complications from congestive heart failure.

ICE press release: ICE detainee passes away at Atlanta hospital

May 15, 2017
Jean Jimenez-Joseph, 27, a Panamanian national in the custody of ICE died Monday at the Phoebe Sumter Medical Center in Americus, GA, he was found unresponsive in his cell at the Stewart Detention Facility in Lumpkin, GA.

ICE press release: ICE detainee passes away at Georgia hospital

April 14, 2017
Sergio Alonso Lopez, 55, passed away at Victor Valley Global Medical Center in Victorville, CA, due to internal bleeding.

ICE press release: ICE detainee passes away in Victorville medical center

March 28, 2017
Osmar Epifanio Gonzalez-Gadba, 32, a Nicaraguan national, passed away at Victor Valley Global Medical Center in Victorville, CA, six days after he attempted to commit suicide.

ICE press release: ICE detainee passes away in Victorville medical center

March 14, 2017
Roger Rayson, 47, a Jamaican national in the custody of ICE died Monday at Lafayette General Hospital in Lafayette, Louisiana. The cause of death is believed to be cardiac arrest.
ICE press release: ICE detainee passes away in Louisiana hospital

November 28, 2016
Raquel Calderon de Hildago, 36, from Guatemala, was pronounced dead by hospital personnel at 11:17 a.m. following a series of seizures. Medical staff at the Eloy Detention Center called paramedics after Calderon suffered a seizure. Database checks indicate she had no criminal history in the United States.
ICE press release: ICE detainee passes away at Arizona hospital

Wenceslau Esmerio Campos, 49, had been detained at the South Texas Detention Complex, in Pearsall, Texas. On November 23, 2016, at 6:43 p.m. the ICE Health Service Corps notified ICE officials that Campos would be taken to the Frio Regional Hospital in Pearsall, Texas, for medical evaluation due to chest pains. On November 25, at 8:55 a.m., Campos was pronounced dead by Methodist Hospital officials. On October 23, 2016, Campos illegally reentered the United Sates near Hidalgo, Texas, where he was arrested by CBP Border Patrol agents. He was turned over to ICE and taken to the South Texas Detention Complex where he remained until he became ill and passed away.
ICE press release: ICE detainee passes away at South Texas hospital

October 26, 2016
Olubunmi Toyin Joshua, 54, from the United Kingdom, who had been detained at the Rolling Plains Detention Center in Haskell, Texas, died at Haskell Hospital in West Texas.
ICE press release: ICE detainee passes away at a West Texas hospital

September 28, 2016
Moises Tino-Lopez, 23, from Guatemala, died at St. Francis Hospital in Grand Island, Nebraska.
ICE press release: ICE detainee passes away in Nebraska hospital

July 29, 2016
Santo Carela, 60, from the Dominican Republic died at Orange Regional Medical Center in New York.
ICE press release: ICE detainee passes away in New York hospital

June 14, 2016
Luis Alonso Fino Martinez, 54, from Honduras, was taken from the Essex County Detention Facility to University Hospital via ambulance June 13. He was pronounced dead at the hospital.
ICE press release: ICE detainee passes away in New Jersey hospital

June 2, 2016
Juan Luis Boch-Paniagua, 36, from Guatemala died at Ochsner Medical Center in Jefferson, Louisiana.
ICE press release: ICE detainee passes away in Louisiana hospital

May 3, 2016
Igor Zyazin, 46, from Russia died at Otay Mesa Detention Center in San Diego, CA.
ICE press release: ICE detainee passes away at San Diego-area detention facility

May 2, 2016
Jose Leonardo Lemus Rajo, 23, from El Salvador died at Kendall Regional Medical Center in Miami, Florida.
ICE press release: ICE detainee passes away at Miami hospital

April 8, 2016
Rafael Barcenas-Padilla, 50, from Mexico died at Del Sol Medical Center in El Paso, Texas.
ICE press release: ICE detainee passes away at Texas hospital

March 18, 2016
Thongchay Saengsiri, 65, from Laos died at LaSalle General Hospital in Jena, Louisiana.
ICE press release: ICE detainee passes away after suffering heart attack

January 25, 2016
Saul Enrique Banegas-Guzman, 46, from Honduras died at Rapides Regional Medical Center in Alexandria, Louisiana.
ICE press release: ICE detainee dies at Louisiana hospital

December 24, 2015
Jose Manuel Azurida-Hernandez, 54, from Guatemala died at St. Mary Medical Center in Apple Valley, California.
ICE press release: ICE detainee passes away after suffering heart attack
]
